# 3. Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
# Проверить работу исключения на реальном примере. Запрашивать у пользователя данные и заполнять список необходимо
# только числами. Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит
# работу скрипта, введя, например, команду «stop». При этом скрипт завершается, сформированный список с числами
# выводится на экран.
# Подсказка: для этого задания примем, что пользователь может вводить только числа и строки. Во время ввода
# пользователем очередного элемента необходимо реализовать проверку типа элемента. Вносить его в список, только
# если введено число. Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить
# соответствующее сообщение. При этом работа скрипта не должна завершаться.

class MyValueError(ValueError):
    pass


def append_num(x1, x2):
    try:
        x1 = int(x1)
        x2.append(x1)
    except ValueError:
        raise MyValueError


my_list = []
while True:
    a = input("введите число ")
    if a != "stop":
        try:
            append_num(a, my_list)
        except MyValueError:
            print("Нужно вводить только числа")
    else:
        break
print(my_list)
